#include "../_启动窗口.h"

void __启动窗口::载入(窗口* 父窗, bool 模态)
{
	if (窗口句柄) return;

	窗口::参数 cs;
	cs.标题 = L"CoutlogServer";
	cs.宽度 = 550;
	cs.高度 = 196;
	cs.边框 = 窗口边框::窄标题可调边框;
	cs.控制按钮 = true;
	cs.最小化按钮 = true;
	cs.最大化按钮 = false;
	cs.在任务栏显示 = true;
	cs.位置 = 窗口位置::居中;
	cs.总在最前 = true;
	cs.可视 = false;
	if (!窗口::创建(cs, 父窗, 模态)) return;

	{
		编辑框::参数 cs = { 10, 10, 530, 410 };
		cs.是否允许多行 = true;
		cs.滚动条 = 编辑框滚动条::横向及纵向滚动条;
		编辑框log._不即时写内容属性_ = true;
		编辑框log.创建(cs, this);
	}

	{
		选择框::参数 cs = { 327, 433, 72, 24 };
		cs.标题 = L"自动滚动";
		cs.选中 = true;
		选择框2.创建(cs, this);
	}

	{
		选择框::参数 cs = { 407, 433, 72, 24 };
		cs.标题 = L"自动换行";
		cs.选中 = false;
		选择框1.创建(cs, this);
	}

	{
		超级列表框::参数 cs = { 10, 10, 530, 410 };
		cs.整行选择 = true;
		cs.边框 = 超级列表框边框::凹入式;
		cs.类型 = 超级列表框类型::报表列表框;
		cs.可视 = false; // Hidden at start
		超级列表框1.创建(cs, this);
		超级列表框1.插入列(-1, L"time", 75);
		超级列表框1.插入列(-1, L"msg", 360);
	}

	{
		编辑框::参数 cs = {};
		cs.可视 = false;
		编辑框_cl.创建(cs, this);
	}

	{
		图片框::参数 cs = { 10, 433, 24, 24 };
		cs.图片 = R::图片框_指针;
		cs.显示方式 = 图片框显示方式::缩放图片;
		图片框1.创建(cs, this);
	}

	{
		按钮::参数 cs = { 40, 433, 52, 24 };
		cs.标题 = L"长窗口";
		按钮_长窗口.创建(cs, this);
	}

	{
		按钮::参数 cs = { 98, 433, 52, 24 };
		cs.标题 = L"切列表";
		按钮_切列表.创建(cs, this);
	}

	{
		标签::参数 cs = { 156, 433, 24, 24 };
		cs.纵向对齐方式 = 纵向对齐::居中;
		cs.标题 = L"端口";
		标签1.创建(cs, this);
	}

	{
		编辑框::参数 cs = { 184, 433, 45, 24 };
		cs.内容 = L"10086";
		编辑框_端口.创建(cs, this);
	}

	{
		按钮::参数 cs = { 487, 433, 52, 24 };
		cs.标题 = L"清空";
		按钮_清空.创建(cs, this);
	}

	{
		超级链接框::参数 cs = { 235, 433, 80, 24 };
		cs.标题 = L"接收文件目录";
		cs.纵向对齐方式 = 纵向对齐::居中;
		cs.文本颜色 = 颜色::深灰;
		cs.背景颜色 = 颜色::默认底色;
		超级链接框1.创建(cs, this);
	}
	popupMenu.挂接资源(IDR_MENU1, 0);

	窗口::完毕(模态);
}