#include "../_启动窗口.h"

void __启动窗口::载入(窗口* 父窗, bool 模态)
{/*由白易插件从XML生成到C++请勿在此进行更改*/
	if (窗口句柄)return;
	{
		窗口::参数 cs{ 50, 50, 568, 196 }; cs.标题 = L"CoutlogServer"; cs.总在最前 = true;
		cs.边框 = 3; cs.位置 = 1; cs.最小化按钮 = true; 窗口::创建(cs, 父窗, 模态);
	}
	{
		外形框::参数 cs{ 332, 166, 208, 24 }; cs.外形 = 0; cs.线型 = -1; 外形框_右.创建(cs, this);
	}
	{
		选择框::参数 cs{ 0, 0, 72, 24 }; cs.标题 = L"自动滚动"; cs.选中 = true;
		选择框2.创建(cs, &外形框_右);
	}
	{
		选择框::参数 cs{ 78, 0, 72, 24 }; cs.标题 = L"自动换行"; 选择框1.创建(cs, &外形框_右);
	}
	{
		按钮::参数 cs{ 156, 0, 52, 24 }; cs.标题 = L"清空"; 按钮_清空.创建(cs, &外形框_右);
	}
	{
		编辑框::参数 cs{ 10, 33, 530, 127 }; cs.是否允许多行 = true; cs.滚动条 = 3;
		编辑框log.创建(cs, this);
	}
	{
		超级列表框::参数 cs{ 10, 33, 530, 127 }; cs.可视 = false; 超级列表框1.创建(cs, this);
	}
	{
		编辑框::参数 cs{ 0, 0, 0, 0 }; cs.可视 = false; 编辑框_cl.创建(cs, this);
	}
	{
		外形框::参数 cs{ 10, 166, 316, 24 }; cs.外形 = 0; cs.线型 = -1; cs.背景颜色 = -1;
		外形框_左.创建(cs, this);
	}
	{
		图片框::参数 cs{ 0, 0, 24, 24 }; cs.显示方式 = 1; 图片框1.创建(cs, &外形框_左);
	}
	{
		按钮::参数 cs{ 30, 0, 52, 24 }; cs.标题 = L"长窗口"; 按钮_长窗口.创建(cs, &外形框_左);
	}
	{
		按钮::参数 cs{ 88, 0, 52, 24 }; cs.标题 = L"切列表"; 按钮_切列表.创建(cs, &外形框_左);
	}
	{
		标签::参数 cs{ 146, 0, 28, 24 }; cs.标题 = L"端口"; 标签1.创建(cs, &外形框_左);
	}
	{
		编辑框::参数 cs{ 180, 0, 45, 24 }; cs.内容 = L"10086"; 编辑框_端口.创建(cs, &外形框_左);
	}
	{
		超级链接框::参数 cs{ 231, 1.5, 70, 24 }; cs.标题 = L"接收文件目录"; cs.文本颜色 = 6316128;
		cs.背景颜色 = 15790320; 超级链接框1.创建(cs, &外形框_左);
	}
	{
		_网格_窗口.绑定(this); _网格_窗口.置内边距(10, 33, 10, 6); _网格_窗口.置间距(6, 6);
		_网格_窗口.设置行({ 网格::比例(1), 网格::像素(24) });
		_网格_窗口.设置列({ 网格::像素(310), 网格::比例(1) });
		_网格_窗口.放置(外形框_右, 1, 1, 1, 1, 网格水平对齐::居右, nil, { 0, 0, 0, 0 });
		_网格_窗口.放置(编辑框log, 0, 0, 1, 2, nil, nil, { 0, 0, 0, 0 });
		_网格_窗口.放置(超级列表框1, 0, 0, 1, 2, nil, nil, { 0, 0, 0, 0 });
		_网格_窗口.放置(外形框_左, 1, 0, 1, 1, nil, nil, { 0, 0, 0, 0 }); _网格_窗口.刷新布局();
	}
	this->完毕(模态);
}

void __启动窗口::完毕(bool 模态)
{
	编辑框log._不即时写内容属性_ = true;
	图片框1.置图片(R::图片框_指针);
	超级列表框1.插入列(-1, L"time", 75);
	超级列表框1.插入列(-1, L"msg", 360);
	popupMenu.挂接资源(IDR_MENU1, 0);
	窗口::完毕(模态);
}
